# db.py: Цей файл зазвичай використовується для з'єднання з базою даних та виконання операцій з нею. У ньому можуть бути визначені функції для створення 
# з'єднання з базою даних, вставки, оновлення, видалення даних, а також функції для отримання даних з бази даних.

# app.py: Цей файл відповідає за логіку вашого веб-застосунку, включаючи маршрутизацію, обробку запитів користувачів та відображення сторінок. 
# У цьому файлі зазвичай визначаються маршрути, що відповідають за різні URL-адреси, обробники запитів, які приймають дані від користувача та здійснюють 
# відповідні дії, такі як збереження даних в базі даних, відображення сторінок тощо.

# Отже, основна різниця полягає в тому, що db.py зазвичай використовується для операцій з базою даних, 
# тоді як app.py відповідає за функціональність вашого веб-застосунку.